print(type("안녕하세요"))
print(type(273))


#문자열 내부에 따옴표 넣기
print('"안녕하세요"라고 말했습니다')

#
print("\"안녕하세요\"라고 말했습니다")

print("동해물과 백두산이 마르고 닳도록\n하느님이 보우하사 우리나라 만세\n무궁화 삼천리 화려 강산\n대한 사람 대한으로 길이 보전하세\n")

print("""동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라 만세
무궁화 삼천리 화려 강산
대한 사람 대한으로 길이 보전하세\n""")

print("""\
동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라 만세
무궁화 삼천리 화려 강산
대한 사람 대한으로 길이 보전하세\
""")

print("\n안녕" + "하세요")
print("안녕하세요" + "!")
print("안녕하세요"*3)
print()
print("문자 선택 연산자에 대해 알아볼까요?")
print("안녕하세요"[0])
print("안녕하세요"[1])
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])
print()
print("문자 선택 연산자에 대해 알아볼까요?")
print("안녕하세요"[-1])
print("안녕하세요"[-2])
print("안녕하세요"[-3])
print("안녕하세요"[-4])
print("안녕하세요"[-5])
print()
print("안녕하세요"[1:4])
print("안녕하세요"[:4])
print()

hello = "안녕하세요"
print(hello[0:2])
print(hello[:4])
print(hello[2:])

hello
print(len("안녕하세요"))